Autodesk.Revit.DB.FaceWall.IsValidFaceReferenceForFaceWall(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Reference)
Identifies if a reference may be used as the parent of a face wall.
Remarks:
The reference must represent a face of a massing instance, and
must be planar, and its normal must not be vertical or horizontal.
document:
The document.
faceReference:
The reference.
Returns:
True if the reference is valid as a parent to a face wall, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.FaceWall.IsWallTypeValidForFaceWall(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Identifies if a wall type may be applied to a face wall.
document:
The document.
wallType:
The wall type.
Returns:
True if the wall type is valid for face wall, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.FaceWall.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.WallLocationLine,Autodesk.Revit.DB.Reference)
Creates a new instance of a wall attached to a non-vertical massing face.
Remarks:
This method will regenerate the document.
document:
The document.
wallType:
The wall type.  This must be a wall type accepted by IsWallTypeValidForFaceWall()
locationLine:
The alignment of the wall location line.
faceReference:
The reference from the massing face.  This must pass IsValidFaceReferenceForFaceWall()
Returns:
The newly created face wall.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element wallType does not exist in the document
-or-
document is not a project document.
-or-
This wall type cannot be applied to a face wall.
-or-
This reference cannot be applied to a face wall.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
During a dynamic update, the newly created face wall is going to be joined to surrounding structures.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The element is a member of a loaded family.
-or-
The element is a member of a group type that is
not being edited.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2011

Autodesk.Revit.DB.FaceWall
A wall attached to a non-vertical massing face.
Since:
2011